In [4]:
import mysql.connector as mysql
import pandas as pd

conn = mysql.connect(
    host = 'localhost',
    user = 'learn',
    passwd = 'demo',
    database = 'demo'
)

sql = 'SELECT Name,Age,Nationality FROM Players WHERE Club LIKE "%Barcelona%"'

In [7]:
cursor = conn.cursor(buffered=True)
cursor.execute(sql)
print(cursor.fetchmany(3))
cursor.close()

[('L. Messi', 31, 'Argentina'), ('L. Suárez', 31, 'Uruguay'), ('M. ter Stegen', 26, 'Germany')]

True

In [9]:
df = pd.read_sql(sql,conn)
df.head()

              Name  Age Nationality
0         L. Messi   31   Argentina
1        L. Suárez   31     Uruguay
2    M. ter Stegen   26     Germany
3  Sergio Busquets   29       Spain
4         Coutinho   26      Brazil

In [10]:
conn.close()